package com.example.collegeapp.home

import com.example.collegeapp.R

class RecyclerDataTemp {
    fun articleList(): List<ArticleEntity> {
        val resultList = mutableListOf<ArticleEntity>()
        resultList.add(
            ArticleEntity(
                "سلام اسنپدراگون تا میتوانی دلی بدست اور که دل شکستن هنر نمی باشد سعدیا مرد نکونام نمیرد هرگز مرده آن سیلبسیبسیبسیبسیبسیبسیبسیبسیب است که نامش به نکویی نبرند",
                R.drawable.background_image,
                "28 فروردین 1401",
                "سبحان بازوبندی",
                "نجوم شناسی , سربازی , اختر شناسی , سعدیا , سلامتی"
            )
        )
        resultList.add(
            ArticleEntity(
                "سلام اسنپدراگون تا میتوانی دلی بدست اور که دل شکستن هنر نمی باشد سعدیا مرد نکونام نمیرد هرگز مرده آن است که نامش به نکویی نبرند",
                R.drawable.background_image,
                "28 فروردین 1401",
                "سبحان بازوبندی",
                "نجوم شناسی , سربازی , اختر شناسی , سعدیا , سلامتی"
            )
        )
        resultList.add(
            ArticleEntity(
                "سلام اسنپدراگون تا میتوانی دلی بدست اور که دل شکستن هنر نمی باشد سعدیا مرد نکونام نمیرد هرگز مرده آن است که نامش به نکویی نبرند",
                R.drawable.background_image,
                "28 فروردین 1401",
                "سبحان بازوبندی",
                "نجوم شناسی , سربازی , اختر شناسی , سعدیا , سلامتی"
            )
        )
        resultList.add(
            ArticleEntity(
                "سلام اسنپدراگون تا میتوانی دلی بدست اور که دل شکستن هنر نمی باشد سعدیا مرد نکونام نمیرد هرگز مرده آن است که نامش به نکویی نبرند",
                R.drawable.background_image,
                "28 فروردین 1401",
                "سبحان بازوبندی",
                "نجوم شناسی , سربازی , اختر شناسی , سعدیا , سلامتی"
            )
        )
        resultList.add(
            ArticleEntity(
                "سلام اسنپدراگون تا میتوانی دلی بدست اور که دل شکستن هنر نمی باشد سعدیا مرد نکونام نمیرد هرگز مرده آن است که نامش به نکویی نبرند",
                R.drawable.background_image,
                "28 فروردین 1401",
                "سبحان بازوبندی",
                "نجوم شناسی , سربازی , اختر شناسی , سعدیا , سلامتی"
            )
        )
        resultList.add(
            ArticleEntity(
                "سلام اسنپدراگون تا میتوانی دلی بدست اور که دل شکستن هنر نمی باشد سعدیا مرد نکونام نمیرد هرگز مرده آن است که نامش به نکویی نبرند",
                R.drawable.background_image,
                "28 فروردین 1401",
                "سبحان بازوبندی",
                "نجوم شناسی , سربازی , اختر شناسی , سعدیا , سلامتی"
            )
        )
        resultList.add(
            ArticleEntity(
                "سلام اسنپدراگون تا میتوانی دلی بدست اور که دل شکستن هنر نمی باشد سعدیا مرد نکونام نمیرد هرگز مرده آن است که نامش به نکویی نبرند",
                R.drawable.background_image,
                "28 فروردین 1401",
                "سبحان بازوبندی",
                "نجوم شناسی , سربازی , اختر شناسی , سعدیا , سلامتی"
            )
        )
        resultList.add(
            ArticleEntity(
                "سلام اسنپدراگون تا میتوانی دلی بدست اور که دل شکستن هنر نمی باشد سعدیا مرد نکونام نمیرد هرگز مرده آن است که نامش به نکویی نبرند",
                R.drawable.background_image,
                "28 فروردین 1401",
                "سبحان بازوبندی",
                "نجوم شناسی , سربازی , اختر شناسی , سعدیا , سلامتی"
            )
        )
        resultList.add(
            ArticleEntity(
                "سلام اسنپدراگون تا میتوانی دلی بدست اور که دل شکستن هنر نمی باشد سعدیا مرد نکونام نمیرد هرگز مرده آن است که نامش به نکویی نبرند",
                R.drawable.background_image,
                "28 فروردین 1401",
                "سبحان بازوبندی",
                "نجوم شناسی , سربازی , اختر شناسی , سعدیا , سلامتی"
            )
        )
        resultList.add(
            ArticleEntity(
                "سلام اسنپدراگون تا میتوانی دلی بدست اور که دل شکستن هنر نمی باشد سعدیا مرد نکونام نمیرد هرگز مرده آن است که نامش به نکویی نبرند",
                R.drawable.background_image,
                "28 فروردین 1401",
                "سبحان بازوبندی",
                "نجوم شناسی , سربازی , اختر شناسی , سعدیا , سلامتی"
            )
        )
        resultList.add(
            ArticleEntity(
                "سلام اسنپدراگون تا میتوانی دلی بدست اور که دل شکستن هنر نمی باشد سعدیا مرد نکونام نمیرد هرگز مرده آن است که نامش به نکویی نبرند",
                R.drawable.background_image,
                "28 فروردین 1401",
                "سبحان بازوبندی",
                "نجوم شناسی , سربازی , اختر شناسی , سعدیا , سلامتی"
            )
        )
        return resultList.toList()
    }
}