package com.example.collegeapp.core.data


fun searchTagLists(): List<String> {
    return listOf(
        "تکنولوژِی",
        "نجوم",
        "مکانیک",
        "تکنولوژِی",
        "نجوم",
        "نانوتکنولوژی",
        "مکانیک",
        "تکنولوژِی",
        "نجوم",
        "نانوتکنولوژی",
        "مکانیک",
        "تکنولوژِی",
        "نجوم",
        "نانوتکنولوژی",
        "مکانیک",
        "تکنولوژِی",
        "نجوم",
        "نانوتکنولوژی",
        "مکانیک",
        "تکنولوژِی",
        "نجوم",
        "نانوتکنولوژی",
        "مکانیک",
    )
}
